espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_struct.h
/** Type of mem_int_st register
 *  SPI0 interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** mem_slv_st_end_int_st : RO; bitpos: [3]; default: 0;
         *  The status bit for SPI_MEM_SLV_ST_END_INT interrupt.
         */
        uint32_t mem_slv_st_end_int_st:1;
        /** mem_mst_st_end_int_st : RO; bitpos: [4]; default: 0;
         *  The status bit for SPI_MEM_MST_ST_END_INT interrupt.
         */
        uint32_t mem_mst_st_end_int_st:1;
        /** mem_ecc_err_int_st : RO; bitpos: [5]; default: 0;
         *  The status bit for SPI_MEM_ECC_ERR_INT interrupt.
         */
        uint32_t mem_ecc_err_int_st:1;
        /** mem_pms_reject_int_st : RO; bitpos: [6]; default: 0;
         *  The status bit for SPI_MEM_PMS_REJECT_INT interrupt.
         */
        uint32_t mem_pms_reject_int_st:1;
        /** mem_axi_raddr_err_int_st : RO; bitpos: [7]; default: 0;
         *  The status bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt.
         */
        uint32_t mem_axi_raddr_err_int_st:1;
        /** mem_axi_wr_flash_err_int_st : RO; bitpos: [8]; default: 0;
         *  The status bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt.
         */
        uint32_t mem_axi_wr_flash_err_int_st:1;
        /** mem_axi_waddr_err_int_st : RO; bitpos: [9]; default: 0;
         *  The status bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt.
         */
        uint32_t mem_axi_waddr_err_int_st:1;
        uint32_t reserved_10:1;
        /** mem_nandflash_pe_fail_int_st : RO; bitpos: [11]; default: 0;
         *  The status bit for SPI_MEM_NANDFLASH_PE_FAIL_INT interrupt.
         */
        uint32_t mem_nandflash_pe_fail_int_st:1;
        /** mem_nandflash_ecc_err_int_st : RO; bitpos: [12]; default: 0;
         *  The status bit for SPI_MEM_NANDFLASH_ECC_ERR_INT interrupt.
         */
        uint32_t mem_nandflash_ecc_err_int_st:1;
        /** mem_xts_fault_detected_int_st : RO; bitpos: [13]; default: 0;
         *  The status bit for SPI_MEM_XTS_FAULT_DETECTED_INT interrupt.
         */
        uint32_t mem_xts_fault_detected_int_st:1;
        uint32_t reserved_14:12;
        /** mem_rx_trans_ovf_int_st : HRO; bitpos: [26]; default: 0;
         *  The status bit for  SPI_MEM_RX_TRANS_OVF_INT interrupt.
         */
        uint32_t mem_rx_trans_ovf_int_st:1;
        /** mem_tx_trans_udf_int_st : HRO; bitpos: [27]; default: 0;
         *  The status bit for SPI_MEM_TX_TRANS_UDF_INT interrupt.
         */
        uint32_t mem_tx_trans_udf_int_st:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} spi_mem_c_int_st_reg_t;


/** Group: DLL debug and  configuration registers */
/** Type of mem_dll_dly_db register
 *  MSPI DLL function and debug configuration register
 */
typedef union {
    struct {
        /** mem_dll_db_cfg_vld_cnt : HRO; bitpos: [7:0]; default: 0;
         *  Configures the end time of the debug window.
         */
        uint32_t mem_dll_db_cfg_vld_cnt:8;
        /** mem_dll_db_cnt_mode_sel : HRO; bitpos: [11:8]; default: 0;
         *  [3]:1-spi_din[15:8]. 0-spi_din[7:0]. [2]:1-only shift wptr or rptr. 0-both shift
         *  wptr and rptr. [1]:1-wprt[3:0] and rptr[3:0]. 0-rptr[3:0] and wprt[3:0].
         *  [0]:1-neg_ptr[3:0]. 0-pos_prt[3:0].
         */
        uint32_t mem_dll_db_cnt_mode_sel:4;
        /** mem_dll_db_cnt_clr : HRO; bitpos: [12]; default: 0;
         *  Configures the start time of the debug window. 1: Clear db_vld_cnt to 0 and Get
         *  ready for debug. 0: No debug.
         */
        uint32_t mem_dll_db_cnt_clr:1;
        /** mem_dll_din_dly_sel : HRO; bitpos: [13]; default: 0;
         *  Configures the din channel. 1: Use  delayed data. 0: Do not use delayed data.
         */
        uint32_t mem_dll_din_dly_sel:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} spi_mem_c_dll_dly_db_reg_t;


/** Group: DLL debug status registers */
/** Type of mem_dll_db_st0 register
 *  MSPI DLL debug status0 register
 */
typedef union {
    struct {
        /** mem_db_fifo_cnt_h : RO; bitpos: [31:0]; default: 0;
         *  Debug  for DLL FIFO pointer. Use a 64bits shift register to record pointer changes
         *  during the debug window. db_fifo_cnt[63:32]
         */
        uint32_t mem_db_fifo_cnt_h:32;
    };
    uint32_t val;
} spi_mem_c_dll_db_st0_reg_t;

/** Type of mem_dll_db_st1 register
 *  MSPI DLL debug status1 register
 */
typedef union {
    struct {
        /** mem_db_fifo_cnt_l : RO; bitpos: [31:0]; default: 0;
         *  Debug  for DLL FIFO pointer. Use a 64bits shift register to record pointer changes
         *  during the debug window. db_fifo_cnt[31:0]
         */
        uint32_t mem_db_fifo_cnt_l:32;
    };
    uint32_t val;
} spi_mem_c_dll_db_st1_reg_t;


/** Group: PMS control and configuration registers */
/** Type of fmem_pmsn_attr register
 *  SPI1 flash PMS section n attribute register
 */
typedef union {
    struct {
        /** fmem_pmsn_rd_attr : R/W; bitpos: [0]; default: 1;
         *  1: SPI1 flash PMS section n read accessible. 0: Not allowed.
         */
        uint32_t fmem_pmsn_rd_attr:1;
        /** fmem_pmsn_wr_attr : R/W; bitpos: [1]; default: 1;
         *  1: SPI1 flash PMS section n write accessible. 0: Not allowed.
         */
        uint32_t fmem_pmsn_wr_attr:1;
        /** fmem_pmsn_ecc : R/W; bitpos: [2]; default: 0;
         *  SPI1 flash PMS section n ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS
         *  section n is configured by registers SPI_FMEM_PMSn_ADDR_REG and
         *  SPI_FMEM_PMSn_SIZE_REG.
         */
        uint32_t fmem_pmsn_ecc:1;
        /** fmem_pmsn_nonsecure_rd_attr : R/W; bitpos: [3]; default: 1;
         *  1: SPI1 flash  non-secure PMS section n read accessible. 0: Not allowed.
         */
        uint32_t fmem_pmsn_nonsecure_rd_attr:1;
        /** fmem_pmsn_nonsecure_wr_attr : R/W; bitpos: [4]; default: 1;
         *  1: SPI1 flash non-secure PMS section n write accessible. 0: Not allowed.
         */
        uint32_t fmem_pmsn_nonsecure_wr_attr:1;
        /** fmem_pmsn_nonsecure_ecc : R/W; bitpos: [5]; default: 0;
         *  SPI1 flash non-secure PMS section n ECC mode, 1: enable ECC mode. 0: Disable it.
         *  The flash PMS section n is configured by registers SPI_FMEM_PMSn_ADDR_REG and
         *  SPI_FMEM_PMSn_SIZE_REG.
         */
        uint32_t fmem_pmsn_nonsecure_ecc:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} spi_fmem_c_pmsn_attr_reg_t;

/** Type of fmem_pmsn_addr register
 *  SPI1 flash PMS section n start address register
 */
typedef union {
    struct {
        /** fmem_pmsn_addr_s : R/W; bitpos: [28:0]; default: 0;
         *  SPI1 flash PMS section n start address value
         */
        uint32_t fmem_pmsn_addr_s:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} spi_fmem_c_pmsn_addr_reg_t;

/** Type of fmem_pmsn_size register
 *  SPI1 flash PMS section n start address register
 */
typedef union {
    struct {
        /** fmem_pmsn_size : R/W; bitpos: [16:0]; default: 4096;
         *  SPI1 flash PMS section n address region is (SPI_FMEM_PMSn_ADDR_S,
         *  SPI_FMEM_PMSn_ADDR_S + SPI_FMEM_PMSn_SIZE)
         */
        uint32_t fmem_pmsn_size:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} spi_fmem_c_pmsn_size_reg_t;

/** Type of smem_pmsn_attr register
 *  SPI1 external RAM PMS section n attribute register
 */
typedef union {
    struct {
        /** smem_pmsn_rd_attr : R/W; bitpos: [0]; default: 1;
         *  1: SPI1 external RAM PMS section n read accessible. 0: Not allowed.
         */
        uint32_t smem_pmsn_rd_attr:1;
        /** smem_pmsn_wr_attr : R/W; bitpos: [1]; default: 1;
         *  1: SPI1 external RAM PMS section n write accessible. 0: Not allowed.
         */
        uint32_t smem_pmsn_wr_attr:1;
        /** smem_pmsn_ecc : R/W; bitpos: [2]; default: 0;
         *  SPI1 external RAM PMS section n ECC mode, 1: enable ECC mode. 0: Disable it. The
         *  external RAM PMS section n is configured by registers SPI_SMEM_PMSn_ADDR_REG and
         *  SPI_SMEM_PMSn_SIZE_REG.
         */
        uint32_t smem_pmsn_ecc:1;
        /** smem_pmsn_nonsecure_rd_attr : R/W; bitpos: [3]; default: 1;
         *  1: SPI1 external RAM non-secure PMS section n read accessible. 0: Not allowed.
         */
        uint32_t smem_pmsn_nonsecure_rd_attr:1;
        /** smem_pmsn_nonsecure_wr_attr : R/W; bitpos: [4]; default: 1;
         *  1: SPI1 external RAM non-secure PMS section n write accessible. 0: Not allowed.
         */
        uint32_t smem_pmsn_nonsecure_wr_attr:1;
        /** smem_pmsn_nonsecure_ecc : R/W; bitpos: [5]; default: 0;
         *  SPI1 external RAM non-secure PMS section n ECC mode, 1: enable ECC mode. 0: Disable
         *  it. The external RAM PMS section n is configured by registers
         *  SPI_SMEM_PMSn_ADDR_REG and SPI_SMEM_PMSn_SIZE_REG.
         */
        uint32_t smem_pmsn_nonsecure_ecc:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} spi_smem_c_pmsn_attr_reg_t;

/** Type of smem_pmsn_addr register
 *  SPI1 external RAM PMS section n start address register
 */
typedef union {
    struct {
        /** smem_pmsn_addr_s : HRO; bitpos: [28:0]; default: 0;
         *  SPI1 external RAM PMS section n start address value
         */
        uint32_t smem_pmsn_addr_s:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} spi_smem_c_pmsn_addr_reg_t;

/** Type of smem_pmsn_size register
 *  SPI1 external RAM PMS section n start address register
 */
typedef union {
    struct {
        /** smem_pmsn_size : HRO; bitpos: [16:0]; default: 4096;
         *  SPI1 external RAM PMS section n address region is (SPI_SMEM_PMSn_ADDR_S,
         *  SPI_SMEM_PMSn_ADDR_S + SPI_SMEM_PMSn_SIZE)
         */
        uint32_t smem_pmsn_size:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} spi_smem_c_pmsn_size_reg_t;

/** Type of mem_pms_reject register
 *  SPI1 access reject register
 */
typedef union {
    struct {
        uint32_t reserved_0:27;
        /** mem_pm_en : R/W; bitpos: [27]; default: 0;
         *  Set this bit to enable SPI0/1 transfer permission control function.
         */
        uint32_t mem_pm_en:1;
        /** mem_pms_ld : R/SS/WTC; bitpos: [28]; default: 0;
         *  1: SPI1 write access error. 0: No write access error. It is cleared by when
         *  SPI_MEM_PMS_REJECT_INT_CLR bit is set.
         */
        uint32_t mem_pms_ld:1;
        /** mem_pms_st : R/SS/WTC; bitpos: [29]; default: 0;
         *  1: SPI1 read access error. 0: No read access error. It is cleared by when
         *  SPI_MEM_PMS_REJECT_INT_CLR bit is set.
         */
        uint32_t mem_pms_st:1;
        /** mem_pms_multi_hit : R/SS/WTC; bitpos: [30]; default: 0;
         *  1: SPI1 access is rejected because of address miss. 0: No address miss error. It is
         *  cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.
         */
        uint32_t mem_pms_multi_hit:1;
        /** mem_pms_ivd : R/SS/WTC; bitpos: [31]; default: 0;
         *  1: SPI1 access is rejected because of address multi-hit. 0: No address multi-hit
         *  error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.
         */
        uint32_t mem_pms_ivd:1;
    };
    uint32_t val;
} spi_mem_c_pms_reject_reg_t;

/** Type of mem_pms_reject_addr register
 *  SPI1 access reject addr register
 */
typedef union {
    struct {
        /** mem_reject_addr : R/SS/WTC; bitpos: [28:0]; default: 0;
         *  This bits show the first SPI1 access error address. It is cleared by when
         *  SPI_MEM_PMS_REJECT_INT_CLR bit is set.
         */
        uint32_t mem_reject_addr:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} spi_mem_c_pms_reject_addr_reg_t;


