espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_struct.h
/** Type of mem_nand_flash_cmd_lut1 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value1 : R/W; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 1.
         */
        uint32_t mem_nand_flash_lut_cmd_value1:16;
        /** mem_nand_flash_lut_sfsm_st_en1 : R/W; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 1.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en1:4;
        /** mem_nand_flash_lut_cmd_len1 : R/W; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 1.
         */
        uint32_t mem_nand_flash_lut_cmd_len1:4;
        /** mem_nand_flash_lut_addr_len1 : R/W; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 1.
         */
        uint32_t mem_nand_flash_lut_addr_len1:4;
        /** mem_nand_flash_lut_data_len1 : R/W; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 1.
         */
        uint32_t mem_nand_flash_lut_data_len1:2;
        /** mem_nand_flash_lut_bus_en1 : R/W; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 1,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT1_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en1:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut1_reg_t;

/** Type of mem_nand_flash_cmd_lut2 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value2 : R/W; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 2.
         */
        uint32_t mem_nand_flash_lut_cmd_value2:16;
        /** mem_nand_flash_lut_sfsm_st_en2 : R/W; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 2.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en2:4;
        /** mem_nand_flash_lut_cmd_len2 : R/W; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 2.
         */
        uint32_t mem_nand_flash_lut_cmd_len2:4;
        /** mem_nand_flash_lut_addr_len2 : R/W; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 2.
         */
        uint32_t mem_nand_flash_lut_addr_len2:4;
        /** mem_nand_flash_lut_data_len2 : R/W; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 2.
         */
        uint32_t mem_nand_flash_lut_data_len2:2;
        /** mem_nand_flash_lut_bus_en2 : R/W; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 2,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT2_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en2:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut2_reg_t;

/** Type of mem_nand_flash_cmd_lut3 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value3 : R/W; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 3.
         */
        uint32_t mem_nand_flash_lut_cmd_value3:16;
        /** mem_nand_flash_lut_sfsm_st_en3 : R/W; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 3.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en3:4;
        /** mem_nand_flash_lut_cmd_len3 : R/W; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 3.
         */
        uint32_t mem_nand_flash_lut_cmd_len3:4;
        /** mem_nand_flash_lut_addr_len3 : R/W; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 3.
         */
        uint32_t mem_nand_flash_lut_addr_len3:4;
        /** mem_nand_flash_lut_data_len3 : R/W; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 3.
         */
        uint32_t mem_nand_flash_lut_data_len3:2;
        /** mem_nand_flash_lut_bus_en3 : R/W; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 3,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT3_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en3:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut3_reg_t;

/** Type of mem_nand_flash_cmd_lut4 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value4 : R/W; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 4.
         */
        uint32_t mem_nand_flash_lut_cmd_value4:16;
        /** mem_nand_flash_lut_sfsm_st_en4 : R/W; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 4.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en4:4;
        /** mem_nand_flash_lut_cmd_len4 : R/W; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 4.
         */
        uint32_t mem_nand_flash_lut_cmd_len4:4;
        /** mem_nand_flash_lut_addr_len4 : R/W; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 4.
         */
        uint32_t mem_nand_flash_lut_addr_len4:4;
        /** mem_nand_flash_lut_data_len4 : R/W; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 4.
         */
        uint32_t mem_nand_flash_lut_data_len4:2;
        /** mem_nand_flash_lut_bus_en4 : R/W; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 4,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT4_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en4:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut4_reg_t;

/** Type of mem_nand_flash_cmd_lut5 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value5 : R/W; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 5.
         */
        uint32_t mem_nand_flash_lut_cmd_value5:16;
        /** mem_nand_flash_lut_sfsm_st_en5 : R/W; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 5.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en5:4;
        /** mem_nand_flash_lut_cmd_len5 : R/W; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 5.
         */
        uint32_t mem_nand_flash_lut_cmd_len5:4;
        /** mem_nand_flash_lut_addr_len5 : R/W; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 5.
         */
        uint32_t mem_nand_flash_lut_addr_len5:4;
        /** mem_nand_flash_lut_data_len5 : R/W; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 5.
         */
        uint32_t mem_nand_flash_lut_data_len5:2;
        /** mem_nand_flash_lut_bus_en5 : R/W; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 5,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT5_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en5:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut5_reg_t;

/** Type of mem_nand_flash_cmd_lut6 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value6 : R/W; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 6.
         */
        uint32_t mem_nand_flash_lut_cmd_value6:16;
        /** mem_nand_flash_lut_sfsm_st_en6 : R/W; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 6.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en6:4;
        /** mem_nand_flash_lut_cmd_len6 : R/W; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 6.
         */
        uint32_t mem_nand_flash_lut_cmd_len6:4;
        /** mem_nand_flash_lut_addr_len6 : R/W; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 6.
         */
        uint32_t mem_nand_flash_lut_addr_len6:4;
        /** mem_nand_flash_lut_data_len6 : R/W; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 6.
         */
        uint32_t mem_nand_flash_lut_data_len6:2;
        /** mem_nand_flash_lut_bus_en6 : R/W; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 6,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT6_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en6:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut6_reg_t;

/** Type of mem_nand_flash_cmd_lut7 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value7 : R/W; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 7.
         */
        uint32_t mem_nand_flash_lut_cmd_value7:16;
        /** mem_nand_flash_lut_sfsm_st_en7 : R/W; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 7.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en7:4;
        /** mem_nand_flash_lut_cmd_len7 : R/W; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 7.
         */
        uint32_t mem_nand_flash_lut_cmd_len7:4;
        /** mem_nand_flash_lut_addr_len7 : R/W; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 7.
         */
        uint32_t mem_nand_flash_lut_addr_len7:4;
        /** mem_nand_flash_lut_data_len7 : R/W; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 7.
         */
        uint32_t mem_nand_flash_lut_data_len7:2;
        /** mem_nand_flash_lut_bus_en7 : R/W; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 7,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT7_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en7:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut7_reg_t;

/** Type of mem_nand_flash_cmd_lut8 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** mem_nand_flash_lut_cmd_value8 : R/W; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 8.
         */
        uint32_t mem_nand_flash_lut_cmd_value8:16;
        /** mem_nand_flash_lut_sfsm_st_en8 : R/W; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 8.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t mem_nand_flash_lut_sfsm_st_en8:4;
        /** mem_nand_flash_lut_cmd_len8 : R/W; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 8.
         */
        uint32_t mem_nand_flash_lut_cmd_len8:4;
        /** mem_nand_flash_lut_addr_len8 : R/W; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 8.
         */
        uint32_t mem_nand_flash_lut_addr_len8:4;
        /** mem_nand_flash_lut_data_len8 : R/W; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 8.
         */
        uint32_t mem_nand_flash_lut_data_len8:2;
        /** mem_nand_flash_lut_bus_en8 : R/W; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 8,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT8_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t mem_nand_flash_lut_bus_en8:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut8_reg_t;

