espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_struct.h
/** Type of mem_nand_flash_spi_seq2 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg2 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 2.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg2:1;
        /** mem_nand_flash_sr_chk_en2 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 2. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en2:1;
        /** mem_nand_flash_din_index2 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 2.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index2:4;
        /** mem_nand_flash_addr_index2 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 2.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index2:4;
        /** mem_nand_flash_req_or_cfg2 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 2. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg2:1;
        /** mem_nand_flash_cmd_index2 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 2. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index2:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq2_reg_t;

/** Type of mem_nand_flash_spi_seq3 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg3 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 3.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg3:1;
        /** mem_nand_flash_sr_chk_en3 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 3. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en3:1;
        /** mem_nand_flash_din_index3 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 3.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index3:4;
        /** mem_nand_flash_addr_index3 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 3.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index3:4;
        /** mem_nand_flash_req_or_cfg3 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 3. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg3:1;
        /** mem_nand_flash_cmd_index3 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 3. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index3:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq3_reg_t;

/** Type of mem_nand_flash_spi_seq4 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg4 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 4.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg4:1;
        /** mem_nand_flash_sr_chk_en4 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 4. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en4:1;
        /** mem_nand_flash_din_index4 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 4.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index4:4;
        /** mem_nand_flash_addr_index4 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 4.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index4:4;
        /** mem_nand_flash_req_or_cfg4 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 4. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg4:1;
        /** mem_nand_flash_cmd_index4 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 4. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index4:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq4_reg_t;

/** Type of mem_nand_flash_spi_seq5 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg5 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 5.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg5:1;
        /** mem_nand_flash_sr_chk_en5 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 5. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en5:1;
        /** mem_nand_flash_din_index5 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 5.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index5:4;
        /** mem_nand_flash_addr_index5 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 5.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index5:4;
        /** mem_nand_flash_req_or_cfg5 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 5. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg5:1;
        /** mem_nand_flash_cmd_index5 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 5. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index5:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq5_reg_t;

/** Type of mem_nand_flash_spi_seq6 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg6 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 6.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg6:1;
        /** mem_nand_flash_sr_chk_en6 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 6. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en6:1;
        /** mem_nand_flash_din_index6 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 6.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index6:4;
        /** mem_nand_flash_addr_index6 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 6.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index6:4;
        /** mem_nand_flash_req_or_cfg6 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 6. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg6:1;
        /** mem_nand_flash_cmd_index6 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 6. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index6:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq6_reg_t;

