espressif/esp-idf/components/soc/esp32s31/register/soc/spi_mem_c_struct.h
/** Type of mem_nand_flash_spi_seq13 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg13 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 13.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg13:1;
        /** mem_nand_flash_sr_chk_en13 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 13. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en13:1;
        /** mem_nand_flash_din_index13 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 13.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index13:4;
        /** mem_nand_flash_addr_index13 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 13.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index13:4;
        /** mem_nand_flash_req_or_cfg13 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 13. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg13:1;
        /** mem_nand_flash_cmd_index13 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 13. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index13:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq13_reg_t;

/** Type of mem_nand_flash_spi_seq14 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg14 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 14.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg14:1;
        /** mem_nand_flash_sr_chk_en14 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 14. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en14:1;
        /** mem_nand_flash_din_index14 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 14.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index14:4;
        /** mem_nand_flash_addr_index14 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 14.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index14:4;
        /** mem_nand_flash_req_or_cfg14 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 14. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg14:1;
        /** mem_nand_flash_cmd_index14 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 14. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index14:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq14_reg_t;

/** Type of mem_nand_flash_spi_seq15 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg15 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 15.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg15:1;
        /** mem_nand_flash_sr_chk_en15 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 15. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en15:1;
        /** mem_nand_flash_din_index15 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 15.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index15:4;
        /** mem_nand_flash_addr_index15 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 15.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index15:4;
        /** mem_nand_flash_req_or_cfg15 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 15. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg15:1;
        /** mem_nand_flash_cmd_index15 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 15. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index15:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq15_reg_t;

/** Type of mem_nand_flash_spi_seq16 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg16 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 16.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg16:1;
        /** mem_nand_flash_sr_chk_en16 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 16. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en16:1;
        /** mem_nand_flash_din_index16 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 16.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index16:4;
        /** mem_nand_flash_addr_index16 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 16.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index16:4;
        /** mem_nand_flash_req_or_cfg16 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 16. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg16:1;
        /** mem_nand_flash_cmd_index16 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 16. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index16:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq16_reg_t;

/** Type of mem_nand_flash_spi_seq17 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg17 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 17.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg17:1;
        /** mem_nand_flash_sr_chk_en17 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 17. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en17:1;
        /** mem_nand_flash_din_index17 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 17.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index17:4;
        /** mem_nand_flash_addr_index17 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 17.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index17:4;
        /** mem_nand_flash_req_or_cfg17 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 17. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg17:1;
        /** mem_nand_flash_cmd_index17 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 17. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index17:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq17_reg_t;

/** Type of mem_nand_flash_spi_seq18 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg18 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 18.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg18:1;
        /** mem_nand_flash_sr_chk_en18 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 18. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en18:1;
        /** mem_nand_flash_din_index18 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 18.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index18:4;
        /** mem_nand_flash_addr_index18 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 18.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index18:4;
        /** mem_nand_flash_req_or_cfg18 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 18. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg18:1;
        /** mem_nand_flash_cmd_index18 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 18. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index18:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq18_reg_t;

/** Type of mem_nand_flash_spi_seq19 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg19 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 19.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg19:1;
        /** mem_nand_flash_sr_chk_en19 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 19. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en19:1;
        /** mem_nand_flash_din_index19 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 19.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index19:4;
        /** mem_nand_flash_addr_index19 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 19.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index19:4;
        /** mem_nand_flash_req_or_cfg19 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 19. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg19:1;
        /** mem_nand_flash_cmd_index19 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 19. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index19:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq19_reg_t;

/** Type of mem_nand_flash_spi_seq20 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** mem_nand_flash_seq_tail_flg20 : R/W; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 20.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t mem_nand_flash_seq_tail_flg20:1;
        /** mem_nand_flash_sr_chk_en20 : R/W; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 20. 1: enable 0: disable.
         */
        uint32_t mem_nand_flash_sr_chk_en20:1;
        /** mem_nand_flash_din_index20 : R/W; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 20.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t mem_nand_flash_din_index20:4;
        /** mem_nand_flash_addr_index20 : R/W; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 20.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t mem_nand_flash_addr_index20:4;
        /** mem_nand_flash_req_or_cfg20 : R/W; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 20. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t mem_nand_flash_req_or_cfg20:1;
        /** mem_nand_flash_cmd_index20 : R/W; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 20. Use to find SPI command
         *  in CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t mem_nand_flash_cmd_index20:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq20_reg_t;

